starter/openfoam/additivefoam/multiBeam/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources (beam1 beam2);

/*---------------------------------------------------------------------------*\
Citation:
    G.L. Knapp, J. Coleman, M. Rolchigo, M. Stoyanov, A. Plotkowski,
    Calibrating uncertain parameters in melt pool simulations of additive 
    manufacturing (2023), https://doi.org/10.1016/j.commatsci.2022.11190.
\*---------------------------------------------------------------------------*/
beam1
{
    pathName            scanPath_1;
 
    absorptionModel     constant;    
    constantCoeffs
    {
        eta             0.33;
    }   

    heatSourceModel     superGaussian;
    superGaussianCoeffs
    {
        dimensions      (85.0e-6 85.0e-6 30e-6);
        k               2.0;
        transient       false;
        nPoints         (10 10 10);
    }
}

/*---------------------------------------------------------------------------*\
Citation:
    J. Coleman, G.L. Knapp, B. Stump, M. Rolchigo, K. Kincaid, A. Plotkowski,
    A dynamic volumetric heat source model for laser additive manufacturing,
    Additive Manufacturing (2024), https://doi.org/10.1016/j.addma.2024.104531.
\*---------------------------------------------------------------------------*/
beam2
{
    pathName            scanPath_2;
 
    absorptionModel     Kelly;    
    KellyCoeffs
    {
        geometry        cone;
        eta0            0.28;
        etaMin          0.35;
    }   

    heatSourceModel     modifiedSuperGaussian;
    modifiedSuperGaussianCoeffs
    {
        dimensions      (40.0e-6 40.0e-6 30e-6);
        m               2.72;
        k               7.95;
        transient       true;
        isoValue        1620;
        nPoints         (10 10 10);
    }
}

// ************************************************************************* //
